Pandas

Pandas is the most widely use tool for data managing.It contains the high data managing and high data structure manupulation tools design to make data analysis fast and easy extracting values from pandas.Pandas is the most popular libraray i.e. used for data analysis.It provide highly optimized performance with backend source code purly written in C and python.Data analysis with python data daframe kmakes manulation of the data easy from selecting a replacing columns and indices the reshaping your data.

In [1]:
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [3]:
ser1 = Series(['a','b','c','d'])

In [4]:
ser1

0    a
1    b
2    c
3    d
dtype: object

In [5]:
Ser2 = Series([1,2,3,4])

In [6]:
Ser2

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
ser3 = Series([1,2,3],index=['A','B','C'])

In [8]:
ser3

A    1
B    2
C    3
dtype: int64

In [9]:
Ser4 = Series(range(1,7),index=list('ABCDEF'))

In [10]:
Ser4

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

In [11]:
Ser5 = Series(['Andman','Bomaby','Channai'],index=list('ABC'))

In [12]:
Ser5

A     Andman
B     Bomaby
C    Channai
dtype: object

In [13]:
type(Ser5)

pandas.core.series.Series

In [14]:
Ser5.index

Index(['A', 'B', 'C'], dtype='object')

In [15]:
Ser5.values

array(['Andman', 'Bomaby', 'Channai'], dtype=object)

In [16]:
Ser = Series([87000,43000,30000,210000,40000],index=['UK','GER','CHAINA','JAPAN','USA'])

In [17]:
Ser

UK         87000
GER        43000
CHAINA     30000
JAPAN     210000
USA        40000
dtype: int64

In [18]:
Ser['CHAINA']

30000

In [19]:
Ser['JAPAN']

210000

In [20]:
Ser>60000

UK         True
GER       False
CHAINA    False
JAPAN      True
USA       False
dtype: bool

In [21]:
Ser[Ser>60000]  #true value return

UK        87000
JAPAN    210000
dtype: int64

#### Apply in operator.

In [22]:
'JAPAN' in Ser

True

In [23]:
'India' in Ser

False

In [24]:
'India' not in Ser

True

#### Series to dictionary.

In [25]:
dict = Ser.to_dict()

In [26]:
dict

{'UK': 87000, 'GER': 43000, 'CHAINA': 30000, 'JAPAN': 210000, 'USA': 40000}

In [27]:
Countries = ['India','UAE','Germany','Japan','USA','Chaina']

In [28]:
Countries

['India', 'UAE', 'Germany', 'Japan', 'USA', 'Chaina']

In [29]:
serr = Series(dict,index=Countries)

In [30]:
serr

India          NaN
UAE            NaN
Germany        NaN
Japan          NaN
USA        40000.0
Chaina         NaN
dtype: float64

In [31]:
serr.isnull()

India       True
UAE         True
Germany     True
Japan       True
USA        False
Chaina      True
dtype: bool

In [32]:
serr.notnull()

India      False
UAE        False
Germany    False
Japan      False
USA         True
Chaina     False
dtype: bool

In [34]:
serr.name = "This is Series"

In [35]:
serr

India          NaN
UAE            NaN
Germany        NaN
Japan          NaN
USA        40000.0
Chaina         NaN
Name: This is Series, dtype: float64

#### Pandas Dataframe.

In [46]:
import pandas as pd

In [47]:
data=pd.read_clipboard('')

In [48]:
data

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,914,520,388,6,0.572,1960,NFC East
1,2,Green Bay Packers,"1,368",756,574,38,0.567,1921,NFC North
2,3,New England Patriots,916,512,395,9,0.564,1960,AFC East
3,4,Chicago Bears,"1,402",769,591,42,0.563,1920,NFC North
4,5,Baltimore Ravens,384,214,169,1,0.559,1996,AFC North
5,6,Miami Dolphins,832,457,371,4,0.552,1966,AFC East
6,7,Minnesota Vikings,902,488,403,11,0.547,1961,NFC North
7,8,San Francisco 49ers,"1,034",545,475,14,0.534,1950,NFC West
8,9,New York Giants,"1,337",696,608,33,0.533,1925,NFC East
9,10,Denver Broncos,916,483,423,10,0.533,1960,AFC West

In [49]:
data.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Division'],
      dtype='object')

In [50]:
df1 = DataFrame(data,columns=['Team','Won','Lost'])

In [51]:
df1

                   Team  Won  Lost
0        Dallas Cowboys  520   388
1     Green Bay Packers  756   574
2  New England Patriots  512   395
3         Chicago Bears  769   591
4      Baltimore Ravens  214   169
5        Miami Dolphins  457   371
6     Minnesota Vikings  488   403
7   San Francisco 49ers  545   475
8       New York Giants  696   608
9        Denver Broncos  483   423

In [53]:
df1['Team']

0          Dallas Cowboys
1       Green Bay Packers
2    New England Patriots
3           Chicago Bears
4        Baltimore Ravens
5          Miami Dolphins
6       Minnesota Vikings
7     San Francisco 49ers
8         New York Giants
9          Denver Broncos
Name: Team, dtype: object

In [55]:
df1['Stadium']='VCA'

In [56]:
df1

                   Team  Won  Lost Stadium
0        Dallas Cowboys  520   388     VCA
1     Green Bay Packers  756   574     VCA
2  New England Patriots  512   395     VCA
3         Chicago Bears  769   591     VCA
4      Baltimore Ravens  214   169     VCA
5        Miami Dolphins  457   371     VCA
6     Minnesota Vikings  488   403     VCA
7   San Francisco 49ers  545   475     VCA
8       New York Giants  696   608     VCA
9        Denver Broncos  483   423     VCA

In [58]:
df1['Count']=range(10)

In [59]:
df1

                   Team  Won  Lost Stadium  Count
0        Dallas Cowboys  520   388     VCA      0
1     Green Bay Packers  756   574     VCA      1
2  New England Patriots  512   395     VCA      2
3         Chicago Bears  769   591     VCA      3
4      Baltimore Ravens  214   169     VCA      4
5        Miami Dolphins  457   371     VCA      5
6     Minnesota Vikings  488   403     VCA      6
7   San Francisco 49ers  545   475     VCA      7
8       New York Giants  696   608     VCA      8
9        Denver Broncos  483   423     VCA      9

In [60]:
del df1['Stadium']

In [61]:
df1

                   Team  Won  Lost  Count
0        Dallas Cowboys  520   388      0
1     Green Bay Packers  756   574      1
2  New England Patriots  512   395      2
3         Chicago Bears  769   591      3
4      Baltimore Ravens  214   169      4
5        Miami Dolphins  457   371      5
6     Minnesota Vikings  488   403      6
7   San Francisco 49ers  545   475      7
8       New York Giants  696   608      8
9        Denver Broncos  483   423      9